Revit 2027 API
Curve.CreateTransformed Method
 Crates a new instance of a curve as a transformation of this curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Curve CreateTransformed(
	Transform transform
)
Public Function CreateTransformed (
	transform As Transform
) As Curve
public:
Curve^ CreateTransformed(
	Transform^ transform
)
member CreateTransformed :
        transform : Transform -> Curve
Parameters
transform Transform
 The transform to apply.
Return Value
Curve
 The new curve.
Exceptions
Exception | Condition
ArgumentException |  transform is not conformal.
ArgumentNullException |  A non-optional argument was NULL
See Also
Reference
Curve Class
Autodesk.Revit.DB Namespace